_help={
   --[Comment]
    -- 序列号
    sn,
   --[Comment]
    -- 标题
    t,
   --[Comment]
    -- 内容
    content,
}

local tittle={
    [1] ="战斗" ,
    [2] ="武将" ,
    [3] ="开发" ,
    [4] ="场景" ,
    [5] ="功能" ,
    [6] ="装备" ,
}

local conTex={
--[Comment]
    -- "战斗" 
      [1]={
	    [1]={ "开始  ", "点击征战按钮，选择出征武将及要攻打的城市，即可进入战斗。"},
	    [2] ={"收益  ", "战斗胜利可俘获对方武将，占领对方领地，城池每10分钟产生一次收益,每次最高可累计一个小时。开发城池是获得银币的最好途径，城池等级越高，收益越高。"},
	    [3] ={"军师技", "军师技为被动技能，战前发动可有效增强己方或削弱敌方。"                                                                                         },
	    [4] ={"武将技", "武将技为主动技能，释放需要消耗技力，在适当的时机使用武将技，往往有扭转局势的效果。"                                                           },
	    [5] ={"副本  ", "已被攻陷的城市将以副本的形式出现，玩家可自行调整难度多次进行攻打，从而获得更多奖励。"                                                         },
   },
   --[Comment]
 -- "武将" 
 [2]={
	  [1] = {"获得武将  ","1.在酒馆招募：在酒馆与武将喝酒增加好感度，将更容易招募成功。".."\n".."2.攻打城池后可以选择招降或者释放武将,武将被释放后将出现在下一座城池。"},
	  [2] = {"增强武将  ","提升武将等级。".."\n".."觉醒武将。".."\n".."军阶提升。".."\n".."更新，强化装备。".."\n".."使用增强道具。".."\n".."升级武将将星。".."\n".."解锁更多技能等都能对武将进行增强。"},
	  [3] = {"阵形克制  ","阵形可在战前界面更改，不同阵形存在互相克制的关系，阵型一旦出现克制,被克制方全属性将下降。"},
	  [4] = {"兵种克制  ","兵种可在战前界面更改，不同兵种存在互相克制的关系，被克制兵种属性将会降低，兵种特性也会失效。"},
	  [5] = {"强化      ","消耗银币对装备进行强化，可有效提升装备属性，增强武将能力。"},
      [6] = {"阵形铭刻  ","武将可使用阵纹符进行阵形铭刻，在战场中，使用铭刻过的阵形，提高各项属性，增强战斗力。"},
      [7] ={"兵种升级  ","提高该兵种的各项属性和兵种特性，增强战斗力。"},
	  [8] ={"技能解锁  ","武将达到指定等级的时候技能会自动得到解锁。"},
      [9] ={"兵种解锁  ","武将达到指定等级后在武将界面消耗金钱，即可对兵种进行解锁。"},
	  [10] ={"阵型解锁  ","武将达到指定等级后在武将界面消耗金钱，即可对阵型进行解锁。"},
      [11] ={"出征武将数","提升主城等级，可增加武将出征最大人数。"},
	  [12] ={"战俘处理  ","打败敌方名将后可以将其俘虏，玩家可选择招降或者释放，释放的武将会出现在下一座城池。"},
  },
 --[Comment]
 -- "开发" 
 [3]={
	  [1] ={ "开发作用","消耗银币开发城市，可提高城市等级，从而获得更多税收。"},
	  [2] ={ "金币    ","完成任务可获得金币奖励，".."\n".."主城可以产出金币。"},
 },
  --[Comment]
 -- "场景" 
  [4]={
	  [1] ={ "征战" ,"PVE地图，玩家将攻占一系列的国家城池，不断扩张自己的版图。"},
	  [2] ={ "争霸" ,"PVP地图，玩家将在此地图与其他玩家展开激战，争夺矿产，占领其他玩家城池，收取税费等。"},
      [3] ={ "国战" ,"PVP地图，三国鼎立，群雄逐鹿，为了荣誉展开激烈厮杀，摧城拔寨，为天下之大统而奋斗。"},
    },
  --[Comment]
  -- "功能"
   [5]={ 
      [1] ={ "主城    ","在主城中，你可以看到自己的收益情况，收获自己的城池。"},
	  [2] ={ "武场    ","武场中提供经典战役，演武榜，实力榜。玩家可在其中获取丰厚奖励，展示自己的实力。"},
	  [3] ={ "体力    ","游戏中征战、副本、地宫都需要消耗体力进行，同时也能获得主城经验。"},
	  [4] ={ "地宫    ","与其他玩家组队挑战迷宫，星魂的主要产出地。"},	
	  [5] ={ "酒馆    ","酒馆定时刷新武将，玩家可与其饮酒增强好感再进行招募，好感度越高，招募成功率越大。"},
	  [6] ={ "背包    ","背包可存放玩家在游戏中获得的各类道具，玩家也可随时打开背包，对存放的道具进行使用或强化等操作。"},
      [7] ={ "名人堂  ","名人堂中列出当前服务器中的贵族，帝王，统帅，神兵，实力的象征。"},
      [8] ={ "经验塔  ","经验塔用于提升武将经验和武将荣誉，每时每刻增强武将实力。"},
      [9] ={ "珍宝阁  ","珍宝阁中提供各种奇珍异宝，定时刷新，也可以选择使用金币刷新。"},
      [10] ={"决斗    ","主城45级开启，等级达到30级的武将可以参与，每一关都有丰厚奖励。"},
      [11] ={"BOSS战  ","每天定时开启，为了个人荣誉与联盟荣誉的战斗，战斗结束后按排名发放相应奖励。"},
      [12] ={"名将谱  ","群英荟萃，蜀汉五虎，曹魏智囊，江东豪杰，各显神通，收集越多，战场收益越高。"},
      [13] ={"占卜    ","拼运气，赌人品，赢取幸运大奖！"},
      [14] ={"副本    ","副本中可以获得经验丹，装备，大量银币等丰厚的奖励。"}, 
      [15] ={"社交    ","社交选项可以联系你的好友，关注你的仇人，并且在争霸地图上给予定位。"},
      [16] ={"联盟    ","主城30级后，玩家可选择创建一个联盟或者加入别人的联盟，共同打造属于联盟内玩家的一片天地。"},
      [17] ={"盟主弹劾"," 1、每个联盟每天只能发起1次弹劾，0点重置，上一个弹劾未结束期间无法进行新的弹劾。".."\n".."2、弹劾由副盟主发起，所有联盟成员参与投票。".."\n".."3、每次弹劾投票阶段持续4小时。".."\n".."4、被弹劾期间的盟主没有踢出成员、任命职位、解散联盟的权限；发起弹劾的副盟主在投票期间不允许退出联盟。".."\n".."5、当天加入联盟的成员不能发起弹劾，也不能参与弹劾投票。".."\n".."6、联盟有效人数低于7人无法发起弹劾。"},
   },
   --[Comment]
  -- "装备" 
   [6]={
	  [1] ={"品质","装备分为白、绿、蓝、紫、橙、红六个品质，其中红色装备最强，并且集齐多件同类红色装备可获得套装特效。"},
	  [2] ={"种类","装备分为四个部件，每个部件可以为武将增加一种属性。"},
	  [3] ={"获得","除了推图可以获得装备外，十连抽和收获城池宝箱也是装备的重要来源。"},
	  [4] ={"专属","部分武将拥有专属装备，专属装备的附加属性需要在加入联盟后才能激活。"},	
	  [5] ={"幻化","蓝色以上装备可以通过幻化来增加附加词条，其中橙色装备最多可以幻化三次。"},
      [6] ={"进阶"," 紫色以上装备可以进行进阶，消耗一件同阶的同种武器，达到强化武器的目的。"},
      [7] ={"宝石"," 宝石分九阶，可以镶嵌在紫色品质以上的装备上，使装备更加强力！"},
   },
}

--[Comment]
--获取规则标题
function _help.GetTittle(sn) return L( tittle[sn] or "" )end
--[Comment]
--获取规则小标题
function _help.GetConTi(sn) return L( conTex[sn] and conTex[sn] or "未知") end
--[Comment]
--获取规则内容
function _help.GetContent(sn,i) return L( conTex[sn] and conTex[sn][i] or "未知") end
--[Comment]
--获取所有标题
function _help.GetAllT() 
    return tittle or nil 
end
--[Comment]
--获取所有内容
function _help.GetAllC() 
    return conTex or nil 
end

--[Comment]
--帮助
DB_Help=_help