return{
[1] = {g="PopRule",i="部署将领，进军敌国城池，战胜敌人，占领城池",n="基础玩法",r="38",sn=1},
[2] = {g="WinQuest",i="每日10-11点、16-17点、22-23点开启",n="限时国家任务",r="2",sn=2},
[3] = {g="PopRankCountryAct",i="限时开启，争夺城池冲击排行获得奖励",n="国家任务-攻城略地",r="3",sn=3},
[4] = {g="PopRankCountryAct",i="限时开启，击杀蛮族冲击排行获得奖励",n="国家任务-蛮族入侵",r="5",sn=4},
[5] = {g="PopRankCountryAct",i="限时开启，攻占目标坚守阵地获得奖励",n="国家任务-攻守兼备",r="7",sn=5},
[6] = {g="WinCountryActiveBox",i="全天开放，完成国战日常获得贡献奖励",n="国战日常",r="",sn=6},
[7] = {g="WinEmpireTech",i="全天开放，提升国战属性",n="国战科技",r="",sn=7}
}